app/Controllers/Controller.php

    public function getAllEtudiants()
    {
        $etudiants = $this->etudiantModel->findAll();
---
SELECT *
FROM `Etudiant`